----------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  V:\ic\jzhang+\va_ctyid_new\ivreg_9216_inter.log
  log type:  text
 opened on:   4 Nov 2020, 00:51:18

. 
. * table 3: 1992 - 2016
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   5,   9388)   =    5272.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9397
                                                Adj R-squared     =     0.9397
                                                Root MSE          =     0.5401

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4336013   .0538701     8.05   0.000     .3280043    .5391983
    DIPW2007 |   .4935815   .0489518    10.08   0.000     .3976254    .5895377
       t2000 |   -.647176   .0442434   -14.63   0.000    -.7339026   -.5604494
       t2007 |  -.3964194   .0478419    -8.29   0.000    -.4901999   -.3026388
 Dorn_DIPW_o |   .7655057   .0723503    10.58   0.000     .6236835    .9073279
       _cons |   .4282176   .0438256     9.77   0.000     .3423099    .5141253
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(5)    =     197.98
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1819
                                                  Root MSE        =     .02774

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0078418   .0015956    -4.91   0.000    -.0109691   -.0047145
    DIPW2000 |   .0029032   .0016877     1.72   0.085    -.0004046     .006211
    DIPW2007 |    .005133   .0015161     3.39   0.001     .0021616    .0081045
       t2000 |  -.0167241   .0035868    -4.66   0.000    -.0237541   -.0096941
       t2007 |  -.0051395   .0021274    -2.42   0.016    -.0093091   -.0009699
       _cons |  -.0041951   .0020711    -2.03   0.043    -.0082543   -.0001359
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4545.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9399
                                                Adj R-squared     =     0.9399
                                                Root MSE          =     0.5391

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4494153   .0561477     8.00   0.000     .3393536    .5594769
    DIPW2007 |   .5029896   .0502409    10.01   0.000     .4045065    .6014726
  mfg_sh_emp |   .4272686   .1287655     3.32   0.001     .1748602    .6796769
       t2000 |  -.6289122   .0435906   -14.43   0.000    -.7143592   -.5434653
       t2007 |  -.3783638   .0461236    -8.20   0.000     -.468776   -.2879516
 Dorn_DIPW_o |    .735391   .0771075     9.54   0.000     .5842435    .8865385
       _cons |   .3735749   .0389391     9.59   0.000     .2972458    .4499039
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =     232.35
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2362
                                                  Root MSE        =     .02681

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |   -.001688   .0022648    -0.75   0.456     -.006127     .002751
    DIPW2000 |  -.0022389   .0023758    -0.94   0.346    -.0068953    .0024176
    DIPW2007 |   .0006239    .001897     0.33   0.742    -.0030941     .004342
  mfg_sh_emp |  -.0668369   .0193172    -3.46   0.001    -.1046979   -.0289758
       t2000 |  -.0155985   .0036583    -4.26   0.000    -.0227687   -.0084283
       t2007 |  -.0055244   .0019915    -2.77   0.006    -.0094277   -.0016211
       _cons |   .0017174   .0023335     0.74   0.462    -.0028561    .0062909
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 2-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_2 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4866.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9397
                                                Adj R-squared     =     0.9397
                                                Root MSE          =     0.5401

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4345964   .0533559     8.15   0.000     .3300073    .5391856
    DIPW2007 |   .4945617   .0484878    10.20   0.000     .3995152    .5896083
       hhi_2 |   .1662384   .2960207     0.56   0.574    -.4140265    .7465032
       t2000 |   -.646329   .0438591   -14.74   0.000    -.7323023   -.5603558
       t2007 |  -.3969677   .0476416    -8.33   0.000    -.4903555   -.3035799
 Dorn_DIPW_o |   .7638145   .0713285    10.71   0.000     .6239951    .9036338
       _cons |   .4146776   .0550235     7.54   0.000     .3068197    .5225355
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =     244.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1827
                                                  Root MSE        =     .02773

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0077253   .0016525    -4.67   0.000    -.0109641   -.0044865
    DIPW2000 |   .0028002   .0017628     1.59   0.112    -.0006549    .0062552
    DIPW2007 |   .0050238   .0015839     3.17   0.002     .0019194    .0081282
       hhi_2 |  -.0087703   .0303146    -0.29   0.772    -.0681857    .0506452
       t2000 |  -.0166934   .0035842    -4.66   0.000    -.0237183   -.0096684
       t2007 |  -.0050644   .0022157    -2.29   0.022    -.0094071   -.0007217
       _cons |  -.0035307    .002629    -1.34   0.179    -.0086834    .0016221
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_2 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_2 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   7,   9386)   =    4327.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9399
                                                Adj R-squared     =     0.9399
                                                Root MSE          =     0.5391

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4489059   .0558436     8.04   0.000     .3394404    .5583714
    DIPW2007 |     .50199   .0497587    10.09   0.000     .4044522    .5995279
       hhi_2 |  -.2983304   .3237229    -0.92   0.357    -.9328975    .3362367
  mfg_sh_emp |   .4617608   .1452427     3.18   0.001     .1770536    .7464681
       t2000 |  -.6289578   .0436379   -14.41   0.000    -.7144976    -.543418
       t2007 |  -.3759222   .0451778    -8.32   0.000    -.4644804    -.287364
 Dorn_DIPW_o |   .7359951   .0766789     9.60   0.000     .5856878    .8863024
       _cons |   .3934625   .0513821     7.66   0.000     .2927424    .4941826
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(7)    =     264.00
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2385
                                                  Root MSE        =     .02677

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0018669   .0022594    -0.83   0.409    -.0062953    .0025615
    DIPW2000 |  -.0020475   .0023726    -0.86   0.388    -.0066978    .0026027
    DIPW2007 |   .0009316      .0019     0.49   0.624    -.0027922    .0046555
       hhi_2 |   .0649809   .0187557     3.46   0.001     .0282204    .1017414
  mfg_sh_emp |  -.0742734   .0195393    -3.80   0.000    -.1125696   -.0359771
       t2000 |  -.0157011   .0036425    -4.31   0.000    -.0228402   -.0085619
       t2007 |  -.0061239   .0020698    -2.96   0.003    -.0101806   -.0020672
       _cons |  -.0025476   .0023558    -1.08   0.280    -.0071648    .0020696
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_2 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 4-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_4 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4979.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9398
                                                Adj R-squared     =     0.9398
                                                Root MSE          =     0.5396

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4291874    .053842     7.97   0.000     .3236455    .5347293
    DIPW2007 |   .4895491   .0490091     9.99   0.000     .3934807    .5856175
       hhi_4 |  -1.196163   .4465905    -2.68   0.007    -2.071577   -.3207491
       t2000 |  -.6470825   .0447226   -14.47   0.000    -.7347485   -.5594164
       t2007 |  -.3931029   .0478132    -8.22   0.000    -.4868273   -.2993786
 Dorn_DIPW_o |   .7728542   .0720845    10.72   0.000     .6315529    .9141555
       _cons |   .4500056   .0445951    10.09   0.000     .3625895    .5374217
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =     213.67
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1861
                                                  Root MSE        =     .02767

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0073862   .0016516    -4.47   0.000    -.0106233   -.0041492
    DIPW2000 |   .0024962   .0017452     1.43   0.153    -.0009243    .0059166
    DIPW2007 |   .0047168   .0015574     3.03   0.002     .0016644    .0077692
       hhi_4 |  -.0567701   .0370256    -1.53   0.125    -.1293388    .0157987
       t2000 |  -.0164248   .0035685    -4.60   0.000    -.0234189   -.0094307
       t2007 |  -.0048015   .0021944    -2.19   0.029    -.0091024   -.0005006
       _cons |  -.0033561   .0019626    -1.71   0.087    -.0072027    .0004905
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_4 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_4 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   7,   9386)   =    4209.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9402
                                                Adj R-squared     =     0.9401
                                                Root MSE          =     0.5380

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4475308   .0558351     8.02   0.000      .338082    .5569796
    DIPW2007 |   .4998256   .0501022     9.98   0.000     .4016144    .5980369
       hhi_4 |  -1.737356   .4828828    -3.60   0.000    -2.683911   -.7908008
  mfg_sh_emp |   .5495665   .1311972     4.19   0.000     .2923915    .8067415
       t2000 |  -.6235487   .0440894   -14.14   0.000    -.7099736   -.5371238
       t2007 |  -.3683788   .0457398    -8.05   0.000    -.4580388   -.2787188
 Dorn_DIPW_o |   .7374444   .0765054     9.64   0.000     .5874773    .8874115
       _cons |   .3895801   .0387355    10.06   0.000     .3136501    .4655101
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(7)    =     250.35
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2362
                                                  Root MSE        =     .02681

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0017153   .0022578    -0.76   0.447    -.0061405    .0027098
    DIPW2000 |  -.0022082   .0023693    -0.93   0.351    -.0068519    .0024356
    DIPW2007 |   .0006686   .0018877     0.35   0.723    -.0030312    .0043684
       hhi_4 |   .0169985   .0265887     0.64   0.523    -.0351144    .0691115
  mfg_sh_emp |  -.0680218   .0198965    -3.42   0.001    -.1070181   -.0290254
       t2000 |  -.0156681   .0036328    -4.31   0.000    -.0227882    -.008548
       t2007 |  -.0056325    .002021    -2.79   0.005    -.0095935   -.0016714
       _cons |    .001571   .0023045     0.68   0.495    -.0029457    .0060877
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_4 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. **********************************************************************************************************
. **********************************************************************************************************
. * replace d10_mfg_sh_wap with d10_emp_i_sh_wap
. * table 3 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   5,   9388)   =    5272.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9397
                                                Adj R-squared     =     0.9397
                                                Root MSE          =     0.5401

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4336013   .0538701     8.05   0.000     .3280043    .5391983
    DIPW2007 |   .4935815   .0489518    10.08   0.000     .3976254    .5895377
       t2000 |   -.647176   .0442434   -14.63   0.000    -.7339026   -.5604494
       t2007 |  -.3964194   .0478419    -8.29   0.000    -.4901999   -.3026388
 Dorn_DIPW_o |   .7655057   .0723503    10.58   0.000     .6236835    .9073279
       _cons |   .4282176   .0438256     9.77   0.000     .3423099    .5141253
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(5)    =    1458.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4464
                                                  Root MSE        =     .07476

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0156183   .0038972    -4.01   0.000    -.0232568   -.0079799
    DIPW2000 |   .0134102   .0041397     3.24   0.001     .0052966    .0215238
    DIPW2007 |   .0141808   .0042619     3.33   0.001     .0058277     .022534
       t2000 |  -.1624906   .0127743   -12.72   0.000    -.1875277   -.1374535
       t2007 |  -.1448124    .010933   -13.25   0.000    -.1662406   -.1233841
       _cons |   .1326787   .0075335    17.61   0.000     .1179133    .1474441
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4545.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9399
                                                Adj R-squared     =     0.9399
                                                Root MSE          =     0.5391

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4494153   .0561477     8.00   0.000     .3393536    .5594769
    DIPW2007 |   .5029896   .0502409    10.01   0.000     .4045065    .6014726
  mfg_sh_emp |   .4272686   .1287655     3.32   0.001     .1748602    .6796769
       t2000 |  -.6289122   .0435906   -14.43   0.000    -.7143592   -.5434653
       t2007 |  -.3783638   .0461236    -8.20   0.000     -.468776   -.2879516
 Dorn_DIPW_o |    .735391   .0771075     9.54   0.000     .5842435    .8865385
       _cons |   .3735749   .0389391     9.59   0.000     .2972458    .4499039
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =    1739.04
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4594
                                                  Root MSE        =     .07387

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0060556   .0040862    -1.48   0.138    -.0140643    .0019532
    DIPW2000 |   .0054197   .0042479     1.28   0.202     -.002906    .0137454
    DIPW2007 |   .0071739   .0048557     1.48   0.140    -.0023431     .016691
  mfg_sh_emp |  -.1038613   .0352563    -2.95   0.003    -.1729624   -.0347603
       t2000 |  -.1607414   .0128043   -12.55   0.000    -.1858373   -.1356455
       t2007 |  -.1454105   .0108373   -13.42   0.000    -.1666511   -.1241698
       _cons |   .1418664   .0088564    16.02   0.000     .1245081    .1592247
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 2-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_2 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4866.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9397
                                                Adj R-squared     =     0.9397
                                                Root MSE          =     0.5401

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4345964   .0533559     8.15   0.000     .3300073    .5391856
    DIPW2007 |   .4945617   .0484878    10.20   0.000     .3995152    .5896083
       hhi_2 |   .1662384   .2960207     0.56   0.574    -.4140265    .7465032
       t2000 |   -.646329   .0438591   -14.74   0.000    -.7323023   -.5603558
       t2007 |  -.3969677   .0476416    -8.33   0.000    -.4903555   -.3035799
 Dorn_DIPW_o |   .7638145   .0713285    10.71   0.000     .6239951    .9036338
       _cons |   .4146776   .0550235     7.54   0.000     .3068197    .5225355
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =    1667.39
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4542
                                                  Root MSE        =     .07422

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0121141   .0032045    -3.78   0.000    -.0183948   -.0058333
    DIPW2000 |   .0103123   .0035908     2.87   0.004     .0032744    .0173502
    DIPW2007 |   .0108965   .0035203     3.10   0.002     .0039968    .0177963
       hhi_2 |  -.2636717   .0710537    -3.71   0.000    -.4029344    -.124409
       t2000 |  -.1615661   .0126874   -12.73   0.000     -.186433   -.1366992
       t2007 |  -.1425535   .0105234   -13.55   0.000    -.1631789   -.1219281
       _cons |    .152654   .0111408    13.70   0.000     .1308185    .1744896
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_2 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_2 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate
> )
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   7,   9386)   =    4327.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9399
                                                Adj R-squared     =     0.9399
                                                Root MSE          =     0.5391

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4489059   .0558436     8.04   0.000     .3394404    .5583714
    DIPW2007 |     .50199   .0497587    10.09   0.000     .4044522    .5995279
       hhi_2 |  -.2983304   .3237229    -0.92   0.357    -.9328975    .3362367
  mfg_sh_emp |   .4617608   .1452427     3.18   0.001     .1770536    .7464681
       t2000 |  -.6289578   .0436379   -14.41   0.000    -.7144976    -.543418
       t2007 |  -.3759222   .0451778    -8.32   0.000    -.4644804    -.287364
 Dorn_DIPW_o |   .7359951   .0766789     9.60   0.000     .5856878    .8863024
       _cons |   .3934625   .0513821     7.66   0.000     .2927424    .4941826
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(7)    =    1923.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4617
                                                  Root MSE        =     .07371

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0055569   .0038948    -1.43   0.154    -.0131906    .0020768
    DIPW2000 |   .0048863   .0040795     1.20   0.231    -.0031094    .0128821
    DIPW2007 |   .0063162   .0045931     1.38   0.169    -.0026861    .0153186
       hhi_2 |  -.1811229    .093883    -1.93   0.054    -.3651302    .0028845
  mfg_sh_emp |  -.0831334   .0432731    -1.92   0.055    -.1679471    .0016803
       t2000 |  -.1604554   .0127789   -12.56   0.000    -.1855016   -.1354093
       t2007 |  -.1437395   .0102883   -13.97   0.000    -.1639042   -.1235747
       _cons |   .1537544   .0110256    13.95   0.000     .1321447    .1753641
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_2 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 4-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_4 t2000 t2007 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   6,   9387)   =    4979.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9398
                                                Adj R-squared     =     0.9398
                                                Root MSE          =     0.5396

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4291874    .053842     7.97   0.000     .3236455    .5347293
    DIPW2007 |   .4895491   .0490091     9.99   0.000     .3934807    .5856175
       hhi_4 |  -1.196163   .4465905    -2.68   0.007    -2.071577   -.3207491
       t2000 |  -.6470825   .0447226   -14.47   0.000    -.7347485   -.5594164
       t2007 |  -.3931029   .0478132    -8.22   0.000    -.4868273   -.2993786
 Dorn_DIPW_o |   .7728542   .0720845    10.72   0.000     .6315529    .9141555
       _cons |   .4500056   .0445951    10.09   0.000     .3625895    .5374217
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(6)    =    1920.97
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4628
                                                  Root MSE        =     .07364

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0112681   .0032215    -3.50   0.000    -.0175822   -.0049541
    DIPW2000 |   .0095237   .0035426     2.69   0.007     .0025803    .0164672
    DIPW2007 |   .0102063   .0036868     2.77   0.006     .0029803    .0174324
       hhi_4 |   -.542064   .0670173    -8.09   0.000    -.6734154   -.4107125
       t2000 |  -.1596329   .0124485   -12.82   0.000    -.1840314   -.1352343
       t2007 |   -.141585   .0105686   -13.40   0.000    -.1622991   -.1208708
       _cons |   .1406895   .0079242    17.75   0.000     .1251584    .1562206
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_4 t2000 t2007 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 DIPW2007 hhi_4 mfg_sh_emp t2000 t2007 [aw=wt_emp_i], first cluster(fipstate
> )
(sum of wgt is   2.6581e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      9,394
                                                No. of clusters   =         50
                                                F(   7,   9386)   =    4209.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9402
                                                Adj R-squared     =     0.9401
                                                Root MSE          =     0.5380

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .4475308   .0558351     8.02   0.000      .338082    .5569796
    DIPW2007 |   .4998256   .0501022     9.98   0.000     .4016144    .5980369
       hhi_4 |  -1.737356   .4828828    -3.60   0.000    -2.683911   -.7908008
  mfg_sh_emp |   .5495665   .1311972     4.19   0.000     .2923915    .8067415
       t2000 |  -.6235487   .0440894   -14.14   0.000    -.7099736   -.5371238
       t2007 |  -.3683788   .0457398    -8.05   0.000    -.4580388   -.2787188
 Dorn_DIPW_o |   .7374444   .0765054     9.64   0.000     .5874773    .8874115
       _cons |   .3895801   .0387355    10.06   0.000     .3136501    .4655101
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      9,394
                                                  Wald chi2(7)    =    2220.62
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4685
                                                  Root MSE        =     .07325

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0053089   .0037467    -1.42   0.156    -.0126524    .0020345
    DIPW2000 |   .0045803   .0039118     1.17   0.242    -.0030867    .0122473
    DIPW2007 |   .0059524   .0045572     1.31   0.192    -.0029795    .0148843
       hhi_4 |  -.4645455   .0860364    -5.40   0.000    -.6331737   -.2959172
  mfg_sh_emp |  -.0714795   .0391096    -1.83   0.068    -.1481329    .0051739
       t2000 |  -.1588377   .0125154   -12.69   0.000    -.1833675   -.1343079
       t2007 |  -.1424581    .010404   -13.69   0.000    -.1628496   -.1220667
       _cons |   .1458671   .0088673    16.45   0.000     .1284875    .1632467
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 DIPW2007 hhi_4 mfg_sh_emp t2000 t2007 Dorn_DIPW_o

. 
. 
. 
. **********************************************************************************************************
. **********************************************************************************************************
. * table 3: re-run 1992 - 2007 using the new emp share construction
. drop if year == 2007
(3,134 observations deleted)

. 
. * table 3 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   3,   6260)   =    5617.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9317
                                                Root MSE          =     0.6353

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3629862   .0593555     6.12   0.000     .2466291    .4793433
       t2000 |  -.5981077   .0461534   -12.96   0.000    -.6885841   -.5076313
 Dorn_DIPW_o |   .8609442   .0796423    10.81   0.000      .704818     1.01707
       _cons |   .3518509   .0479776     7.33   0.000     .2577984    .4459035
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(3)    =     169.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1659
                                                  Root MSE        =     .03217

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0083518   .0016211    -5.15   0.000     -.011529   -.0051745
    DIPW2000 |   .0034131    .001669     2.04   0.041     .0001419    .0066844
       t2000 |  -.0172548   .0035316    -4.89   0.000    -.0241767    -.010333
       _cons |  -.0036644   .0020563    -1.78   0.075    -.0076947     .000366
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4277.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9317
                                                Root MSE          =     0.6353

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3686659   .0642158     5.74   0.000     .2427808     .494551
  mfg_sh_emp |   .1306851   .1907208     0.69   0.493    -.2431931    .5045633
       t2000 |  -.5931071   .0458436   -12.94   0.000    -.6829763   -.5032379
 Dorn_DIPW_o |   .8505942   .0890858     9.55   0.000     .6759555    1.025233
       _cons |   .3360493   .0416281     8.07   0.000     .2544439    .4176546
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     203.22
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2429
                                                  Root MSE        =     .03065

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0004108   .0025635    -0.16   0.873    -.0054352    .0046136
    DIPW2000 |  -.0032211   .0025973    -1.24   0.215    -.0083117    .0018695
  mfg_sh_emp |  -.0863243   .0240289    -3.59   0.000    -.1334202   -.0392285
       t2000 |  -.0158084   .0035731    -4.42   0.000    -.0228115   -.0088053
       _cons |   .0039794   .0027632     1.44   0.150    -.0014363    .0093952
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 mfg_sh_emp t2000 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 2-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_2 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4314.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9318
                                                Root MSE          =     0.6350

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3572904   .0582217     6.14   0.000     .2431559     .471425
       hhi_2 |  -.7550995   .4201906    -1.80   0.072    -1.578817    .0686182
       t2000 |  -.6011381   .0467855   -12.85   0.000    -.6928537   -.5094225
 Dorn_DIPW_o |   .8702149   .0776266    11.21   0.000     .7180402     1.02239
       _cons |   .4120823   .0676777     6.09   0.000     .2794107    .5447539
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     182.24
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1708
                                                  Root MSE        =     .03208

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0078009    .001702    -4.58   0.000    -.0111368    -.004465
    DIPW2000 |   .0029218   .0017772     1.64   0.100    -.0005615    .0064051
       hhi_2 |  -.0386279   .0400511    -0.96   0.335    -.1171265    .0398707
       t2000 |  -.0170804   .0035301    -4.84   0.000    -.0239992   -.0101616
       _cons |   -.000777   .0031249    -0.25   0.804    -.0069017    .0053477
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_2 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_2 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   5,   6258)   =    3556.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9319
                                                Adj R-squared     =     0.9318
                                                Root MSE          =     0.6348

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3662408   .0632891     5.79   0.000     .2421725    .4903091
       hhi_2 |  -1.007986   .5078763    -1.98   0.047    -2.003598   -.0123745
  mfg_sh_emp |   .2498317   .2172622     1.15   0.250    -.1760767    .6757401
       t2000 |  -.5925934   .0459218   -12.90   0.000     -.682616   -.5025709
 Dorn_DIPW_o |   .8535336   .0877739     9.72   0.000     .6814666    1.025601
       _cons |   .4020459   .0626858     6.41   0.000     .2791601    .5249316
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(5)    =     203.91
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2444
                                                  Root MSE        =     .03062

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0006217   .0025524    -0.24   0.808    -.0056244     .004381
    DIPW2000 |  -.0029954   .0025866    -1.16   0.247    -.0080651    .0020744
       hhi_2 |   .0615041   .0250924     2.45   0.014     .0123239    .1106842
  mfg_sh_emp |  -.0935667   .0248337    -3.77   0.000    -.1422399   -.0448935
       t2000 |  -.0159648   .0035689    -4.47   0.000    -.0229596     -.00897
       _cons |   .0000234   .0026576     0.01   0.993    -.0051855    .0052322
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_2 mfg_sh_emp t2000 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 4-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_4 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4406.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9324
                                                Adj R-squared     =     0.9323
                                                Root MSE          =     0.6326

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3499527   .0584727     5.98   0.000     .2353262    .4645792
       hhi_4 |  -2.716073   .7154323    -3.80   0.000    -4.118566    -1.31358
       t2000 |   -.595803   .0470377   -12.67   0.000     -.688013    -.503593
 Dorn_DIPW_o |   .8816995   .0780064    11.30   0.000     .7287803    1.034619
       _cons |   .3980676    .050204     7.93   0.000     .2996506    .4964846
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     175.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1751
                                                  Root MSE        =       .032

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0075312   .0017006    -4.43   0.000    -.0108644   -.0041981
    DIPW2000 |   .0026717   .0017536     1.52   0.128    -.0007652    .0061086
       hhi_4 |   -.092445   .0478774    -1.93   0.053    -.1862829    .0013929
       t2000 |  -.0166856    .003501    -4.77   0.000    -.0235475   -.0098238
       _cons |    -.00238   .0019568    -1.22   0.224    -.0062154    .0014553
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_4 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_mfg_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_4 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   5,   6258)   =    3533.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9325
                                                Adj R-squared     =     0.9324
                                                Root MSE          =     0.6321

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3624945   .0628834     5.76   0.000     .2392214    .4857676
       hhi_4 |  -2.981844     .77399    -3.85   0.000     -4.49913   -1.464558
  mfg_sh_emp |    .317921   .1965554     1.62   0.106     -.067395    .7032371
       t2000 |  -.5834125   .0463293   -12.59   0.000    -.6742338   -.4925912
 Dorn_DIPW_o |   .8585517   .0868989     9.88   0.000        .6882    1.028903
       _cons |   .3641488   .0417236     8.73   0.000     .2823563    .4459413
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(5)    =     203.20
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2429
                                                  Root MSE        =     .03065

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_mfg_sh~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0004077   .0025526    -0.16   0.873    -.0054107    .0045952
    DIPW2000 |  -.0032242   .0025843    -1.25   0.212    -.0082893    .0018408
       hhi_4 |  -.0009842   .0319248    -0.03   0.975    -.0635557    .0615873
  mfg_sh_emp |  -.0862629   .0245209    -3.52   0.000     -.134323   -.0382029
       t2000 |  -.0158034   .0035412    -4.46   0.000    -.0227439   -.0088628
       _cons |   .0039877   .0027158     1.47   0.142    -.0013351    .0093105
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_4 mfg_sh_emp t2000 Dorn_DIPW_o

. 
. 
. 
. ********************************************************************************************************** 
. ********************************************************************************************************** 
. * replace d10_mfg_sh_wap with d10_emp_i_sh_wap
. * table 3 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   3,   6260)   =    5617.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9317
                                                Root MSE          =     0.6353

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3629862   .0593555     6.12   0.000     .2466291    .4793433
       t2000 |  -.5981077   .0461534   -12.96   0.000    -.6885841   -.5076313
 Dorn_DIPW_o |   .8609442   .0796423    10.81   0.000      .704818     1.01707
       _cons |   .3518509   .0479776     7.33   0.000     .2577984    .4459035
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(3)    =     515.15
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4539
                                                  Root MSE        =     .08326

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |   -.016443   .0039439    -4.17   0.000    -.0241728   -.0087131
    DIPW2000 |   .0142349   .0041588     3.42   0.001     .0060837     .022386
       t2000 |  -.1633488    .012729   -12.83   0.000    -.1882971   -.1384005
       _cons |    .133537   .0075685    17.64   0.000     .1187029     .148371
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4277.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9317
                                                Root MSE          =     0.6353

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3686659   .0642158     5.74   0.000     .2427808     .494551
  mfg_sh_emp |   .1306851   .1907208     0.69   0.493    -.2431931    .5045633
       t2000 |  -.5931071   .0458436   -12.94   0.000    -.6829763   -.5032379
 Dorn_DIPW_o |   .8505942   .0890858     9.55   0.000     .6759555    1.025233
       _cons |   .3360493   .0416281     8.07   0.000     .2544439    .4176546
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     518.75
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4759
                                                  Root MSE        =     .08157

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0028499   .0034541    -0.83   0.409    -.0096198    .0039201
    DIPW2000 |   .0028786   .0038272     0.75   0.452    -.0046225    .0103798
  mfg_sh_emp |  -.1477675   .0327548    -4.51   0.000    -.2119657   -.0835693
       t2000 |  -.1608729    .012644   -12.72   0.000    -.1856546   -.1360911
       _cons |   .1466214   .0092073    15.92   0.000     .1285754    .1646674
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 mfg_sh_emp t2000 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 2-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_2 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4314.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9318
                                                Adj R-squared     =     0.9318
                                                Root MSE          =     0.6350

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3572904   .0582217     6.14   0.000     .2431559     .471425
       hhi_2 |  -.7550995   .4201906    -1.80   0.072    -1.578817    .0686182
       t2000 |  -.6011381   .0467855   -12.85   0.000    -.6928537   -.5094225
 Dorn_DIPW_o |   .8702149   .0776266    11.21   0.000     .7180402     1.02239
       _cons |   .4120823   .0676777     6.09   0.000     .2794107    .5447539
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     508.36
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4700
                                                  Root MSE        =     .08203

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0106115   .0029889    -3.55   0.000    -.0164697   -.0047534
    DIPW2000 |   .0090336    .003361     2.69   0.007     .0024461    .0156211
       hhi_2 |  -.4089208     .07324    -5.58   0.000    -.5524686    -.265373
       t2000 |  -.1615021   .0125754   -12.84   0.000    -.1861494   -.1368548
       _cons |   .1641032   .0112536    14.58   0.000     .1420465    .1861599
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_2 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_2 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   5,   6258)   =    3556.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9319
                                                Adj R-squared     =     0.9318
                                                Root MSE          =     0.6348

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3662408   .0632891     5.79   0.000     .2421725    .4903091
       hhi_2 |  -1.007986   .5078763    -1.98   0.047    -2.003598   -.0123745
  mfg_sh_emp |   .2498317   .2172622     1.15   0.250    -.1760767    .6757401
       t2000 |  -.5925934   .0459218   -12.90   0.000     -.682616   -.5025709
 Dorn_DIPW_o |   .8535336   .0877739     9.72   0.000     .6814666    1.025601
       _cons |   .4020459   .0626858     6.41   0.000     .2791601    .5249316
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(5)    =     514.00
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4806
                                                  Root MSE        =      .0812

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0018661   .0032408    -0.58   0.565    -.0082179    .0044857
    DIPW2000 |   .0018256    .003648     0.50   0.617    -.0053242    .0089755
       hhi_2 |  -.2869449    .088969    -3.23   0.001     -.461321   -.1125689
  mfg_sh_emp |  -.1139784   .0383173    -2.97   0.003    -.1890788    -.038878
       t2000 |  -.1601432   .0126156   -12.69   0.000    -.1848693   -.1354171
       _cons |   .1650782   .0110554    14.93   0.000       .14341    .1867463
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_2 mfg_sh_emp t2000 Dorn_DIPW_o

. 
. ********************************************************************************************************** 
. * add HHI @ 4-digit NAICS
. ********************************************************************************************************** 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_4 t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   4,   6259)   =    4406.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9324
                                                Adj R-squared     =     0.9323
                                                Root MSE          =     0.6326

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3499527   .0584727     5.98   0.000     .2353262    .4645792
       hhi_4 |  -2.716073   .7154323    -3.80   0.000    -4.118566    -1.31358
       t2000 |   -.595803   .0470377   -12.67   0.000     -.688013    -.503593
 Dorn_DIPW_o |   .8816995   .0780064    11.30   0.000     .7287803    1.034619
       _cons |   .3980676    .050204     7.93   0.000     .2996506    .4964846
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(4)    =     558.42
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4774
                                                  Root MSE        =     .08145

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0104777   .0031893    -3.29   0.001    -.0167286   -.0042268
    DIPW2000 |   .0088445   .0034672     2.55   0.011     .0020489    .0156401
       hhi_4 |   -.672073   .0783261    -8.58   0.000    -.8255892   -.5185567
       t2000 |  -.1592107   .0123384   -12.90   0.000    -.1833935   -.1350279
       _cons |    .142874   .0078244    18.26   0.000     .1275385    .1582096
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_4 t2000 Dorn_DIPW_o

. 
. ivregress 2sls d10_emp_i_sh_wap (Dorn_DIPW=Dorn_DIPW_o) DIPW2000 hhi_4 mfg_sh_emp t2000 [aw=wt_emp_i], first cluster(fipstate)
(sum of wgt is   1.7721e+08)

First-stage regressions
-----------------------

                                                Number of obs     =      6,264
                                                No. of clusters   =         50
                                                F(   5,   6258)   =    3533.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9325
                                                Adj R-squared     =     0.9324
                                                Root MSE          =     0.6321

------------------------------------------------------------------------------
             |               Robust
   Dorn_DIPW |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    DIPW2000 |   .3624945   .0628834     5.76   0.000     .2392214    .4857676
       hhi_4 |  -2.981844     .77399    -3.85   0.000     -4.49913   -1.464558
  mfg_sh_emp |    .317921   .1965554     1.62   0.106     -.067395    .7032371
       t2000 |  -.5834125   .0463293   -12.59   0.000    -.6742338   -.4925912
 Dorn_DIPW_o |   .8585517   .0868989     9.88   0.000        .6882    1.028903
       _cons |   .3641488   .0417236     8.73   0.000     .2823563    .4459413
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      6,264
                                                  Wald chi2(5)    =     549.81
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.4876
                                                  Root MSE        =     .08065

                              (Std. Err. adjusted for 50 clusters in fipstate)
------------------------------------------------------------------------------
             |               Robust
d10_emp_i_~p |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   Dorn_DIPW |  -.0011183   .0030658    -0.36   0.715    -.0071272    .0048907
    DIPW2000 |    .001098   .0034607     0.32   0.751    -.0056847    .0078808
       hhi_4 |  -.5519051   .0943176    -5.85   0.000    -.7367643    -.367046
  mfg_sh_emp |  -.1133385   .0352148    -3.22   0.001    -.1823583   -.0443188
       t2000 |  -.1580515   .0123573   -12.79   0.000    -.1822713   -.1338317
       _cons |   .1512404   .0090553    16.70   0.000     .1334923    .1689885
------------------------------------------------------------------------------
Instrumented:  Dorn_DIPW
Instruments:   DIPW2000 hhi_4 mfg_sh_emp t2000 Dorn_DIPW_o

. log close
      name:  <unnamed>
       log:  V:\ic\jzhang+\va_ctyid_new\ivreg_9216_inter.log
  log type:  text
 closed on:   4 Nov 2020, 00:51:23
----------------------------------------------------------------------------------------------------------------------------------------------
